# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in this lab's data folder.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [2]:
# import libraries here
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [12]:
# your code here
temp = pd.read_csv('../Aula_23/Temp_States.csv', sep=';')

#### Print `temp`.

In [28]:
# your code here
temp

         City        State  Temperature  Unnamed: 3
0         NYC     New York    19.444444         NaN
1      Albany     New York     9.444444         NaN
2     Buffalo     New York     3.333333         NaN
3    Hartford  Connecticut    17.222222         NaN
4  Bridgeport  Connecticut    14.444444         NaN
5      Treton   New Jersey    22.222222         NaN
6      Newark   New Jersey    20.000000         NaN

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [8]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
Unnamed: 3     float64
dtype: object

In [ ]:
"""
There are two categorical columns and one numerical column. 
"""

#### Select the rows where state is New York.

In [25]:
# your code here
nytemp = temp.query('State == "New York"')[['City', 'State', 'Temperature']]

#### What is the average temperature of cities in New York?

In [26]:
# your code here
nytemp['Temperature'].mean()

10.740740739000001

#### Which states and cities have a temperature above 15 degrees Celsius?

In [27]:
# your code here
temp.query('Temperature > 15')[['City', 'State', 'Temperature']]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [29]:
# your code here
temp.query('Temperature > 15')[['City', 'Temperature']]

       City  Temperature
0       NYC    19.444444
3  Hartford    17.222222
5    Treton    22.222222
6    Newark    20.000000

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [30]:
# your code here
temp.query('Temperature > 15 & Temperature < 20')[['City', 'Temperature']]

       City  Temperature
0       NYC    19.444444
3  Hartford    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [33]:
# your code here
state_temp = temp.groupby(by='State')['Temperature'].agg(mean = 'mean', std = 'std').reset_index()
state_temp

         State       mean       std
0  Connecticut  15.833333  1.964186
1   New Jersey  21.111111  1.571348
2     New York  10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [36]:
# your code here
employees = pd.read_csv('../Aula_23/employees.csv', sep=';')

In [41]:
employees.head()

     Name Department Education Gender      Title  Years  Salary  Unnamed: 7
0    Jose         IT  Bachelor      M    analyst      1      35         NaN
1   Maria         IT    Master      F    analyst      2      30         NaN
2   David         HR    Master      M    analyst      2      30         NaN
3   Sonia         HR  Bachelor      F    analyst      4      35         NaN
4  Samuel      Sales    Master      M  associate      3      55         NaN

#### Explore the data types of the `employees` dataframe. Comment your results.

In [39]:
# your code here
employees.dtypes

Name           object
Department     object
Education      object
Gender         object
Title          object
Years           int64
Salary          int64
Unnamed: 7    float64
dtype: object

In [0]:
"""
There are 5 categorical variables and 2 numerical variables.
"""

#### What's the average salary in this company?

In [57]:
# your code here
mean_salary = employees['Salary'].describe()['mean']
mean_salary

48.888888888888886

#### What's the highest salary?

In [51]:
# your code here
max_salary = employees['Salary'].describe()['max']
max_salary

70.0

#### What's the lowest salary?

In [52]:
# your code here
min_salary = employees['Salary'].describe()['min']
min_salary

30.0

#### Who are the employees with the lowest salary?

In [66]:
# your code here
employees.query('Salary < @mean_salary')

    Name Department Education Gender    Title  Years  Salary  Unnamed: 7
0   Jose         IT  Bachelor      M  analyst      1      35         NaN
1  Maria         IT    Master      F  analyst      2      30         NaN
2  David         HR    Master      M  analyst      2      30         NaN
3  Sonia         HR  Bachelor      F  analyst      4      35         NaN

#### Find all the information about an employee called David.

In [65]:
# your code here
employees.loc[employees['Name'] == 'David']

    Name Department Education Gender    Title  Years  Salary  Unnamed: 7
2  David         HR    Master      M  analyst      2      30         NaN

#### Could you return only David's salary?

In [69]:
# your code here
employees.loc[employees['Name'] == 'David', 'Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [70]:
# your code here
employees.loc[employees['Title'] == 'analyst']

    Name Department Education Gender    Title  Years  Salary  Unnamed: 7
0   Jose         IT  Bachelor      M  analyst      1      35         NaN
1  Maria         IT    Master      F  analyst      2      30         NaN
2  David         HR    Master      M  analyst      2      30         NaN
3  Sonia         HR  Bachelor      F  analyst      4      35         NaN

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [72]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary  Unnamed: 7
0   Jose         IT  Bachelor      M  analyst      1      35         NaN
1  Maria         IT    Master      F  analyst      2      30         NaN
2  David         HR    Master      M  analyst      2      30         NaN

In [75]:
# Method 2
# your code here
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary  Unnamed: 7
0   Jose         IT  Bachelor      M  analyst      1      35         NaN
1  Maria         IT    Master      F  analyst      2      30         NaN
2  David         HR    Master      M  analyst      2      30         NaN

#### Find the employees whose title is associate and whose salary is above 55.

In [77]:
# your code here
employees.query('Title == "associate" & Salary > 55')

    Name Department Education Gender      Title  Years  Salary  Unnamed: 7
7  Pedro         IT       Phd      M  associate      7      60         NaN

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [80]:
# your code here
employees.groupby(by='Years')['Salary'].mean().reset_index()

   Years     Salary
0      1  35.000000
1      2  38.333333
2      3  55.000000
3      4  35.000000
4      7  60.000000
5      8  70.000000

####  What is the average salary per title?

In [83]:
# your code here
employees.groupby(by='Title')['Salary'].mean().reset_index()

       Title     Salary
0         VP  70.000000
1    analyst  32.500000
2  associate  56.666667

####  Find the salary quartiles.

In [88]:
# your code here
salary_stats = employees['Salary'].describe()
q1 = salary_stats['25%']
q2 = salary_stats['50%']
q3 = salary_stats['75%']

salstats_table = pd.DataFrame({
                    'Quartile' : ['Q1', 'Median', 'Q3'], 
                    'Value' : [q1,q2,q3]
                    })
salstats_table

  Quartile  Value
0       Q1   35.0
1   Median   55.0
2       Q3   60.0

#### Is the mean salary different per gender?

In [89]:
# your code here
employees.groupby(by='Gender')['Salary'].mean().reset_index()

  Gender  Salary
0      F    47.5
1      M    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [91]:
# your code here
employees.groupby(by='Department')['Salary'].agg(
                                            minimum = 'min',
                                            mean = 'mean',
                                            maximum = 'max'
                                            ).reset_index()

  Department  minimum   mean  maximum
0         HR       30  45.00       70
1         IT       30  48.75       70
2      Sales       55  55.00       55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [108]:
# your code here
employees.groupby(by='Department')['Salary'].apply(lambda x: x.max() - x.min())

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [109]:
# your code here
orders = pd.read_csv('../Aula_23/Orders.csv')

In [116]:
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [111]:
# your code here
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [114]:
orders.describe().T

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,397924.0,278465.221859,152771.368303,0.0,148333.75,284907.50,410079.25,541908.00
InvoiceNo,397924.0,560617.126645,13106.167695,536365.0,549234.00,561893.00,572090.00,581587.00
year,397924.0,2010.934259,0.247829,2010.0,2011.00,2011.00,2011.00,2011.00
month,397924.0,7.612537,3.416527,1.0,5.00,8.00,11.00,12.00
day,397924.0,3.614555,1.928274,1.0,2.00,3.00,5.00,7.00
hour,397924.0,12.728247,2.273535,6.0,11.00,13.00,14.00,20.00
Quantity,397924.0,13.021823,180.420210,1.0,2.00,6.00,12.00,80995.00
UnitPrice,397924.0,3.116174,22.096788,0.0,1.25,1.95,3.75,8142.75
CustomerID,397924.0,15294.315171,1713.169877,12346.0,13969.00,15159.00,16795.00,18287.00
amount_spent,397924.0,22.394749,309.055588,0.0,4.68,11.80,19.80,168469.60

In [0]:
"""
your comments here
"""

####  What is the average purchase price?

In [117]:
# your code here
orders['UnitPrice'].mean()

3.1161744805540756

#### What are the highest and lowest purchase prices?

In [118]:
# your code here
max_price = orders['UnitPrice'].max()
min_price = orders['UnitPrice'].min()

print(max_price, min_price)

8142.75 0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [176]:
# your code here
spain_ids = list(orders.query('Country == "Spain"')['CustomerID'].unique())
spain_ids

[12557,
 17097,
 12540,
 12551,
 12484,
 12539,
 12510,
 12421,
 12502,
 12462,
 12507,
 12541,
 12547,
 12597,
 12545,
 12596,
 12354,
 12417,
 12455,
 12450,
 12548,
 12556,
 12550,
 12546,
 12454,
 12448,
 12544,
 12538,
 12445,
 12442]

#### How many customers do we have in Spain?

In [144]:
# your code here
spain_ids.count()

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [177]:
# your code here
orders.groupby(by='CustomerID')['Quantity'].sum().reset_index().query('Quantity > 50')

      CustomerID  Quantity
0          12346     74215
1          12347      2458
2          12348      2341
3          12349       631
4          12350       197
...          ...       ...
4333       18278        66
4335       18281        54
4336       18282       103
4337       18283      1397
4338       18287      1586

[4091 rows x 2 columns]

#### Select orders from Spain that include more than 50 items.

In [183]:
# your code here

#### Select all free orders.

In [0]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [0]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [0]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [0]:
# your code here

#### Select all orders made in the month of August.

In [0]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [0]:
# your code here

#### What's the  average amount of money spent by country?

In [0]:
# your code here

#### What's the most expensive item?

In [0]:
# your code here

#### What is the average amount spent per year?

In [0]:
# your code here